/*Дано действительное число R вида nnn.ddd (три цифровых разряда в дробной и целой частях). Поменять местами
дробную и целую части числа и вывести полученное значение числа.
*/
package module1.lineaer;

import java.util.Scanner;

public class Task4 {
    public static void main(String[] agrs) {
        Scanner scanner = new Scanner (System.in);
        System.out.println("Введите число");

    }

}
